# Дана строка. Преобразовать в ней все строчные буквы (как латинские, так и русские)
# в прописные, а прописные — в строчные.

st = 'Я люБлю ПрЕдмет ОсНоВы алгоритмизации и ПРОГРАММИРОВАНИЯ'
print(st.swapcase())